In [137]:
import pandas as pd

# Series 
 A Series is a One-Dimeinsional labeled array that can represent:
  1. A Single column from a dataframe.
  2. A Single row from a dataframe

In [138]:
val = [1,2,3,4]
s = pd.Series(val,index=['x1','x2','x3','x4'], dtype='int32')
s

x1    1
x2    2
x3    3
x4    4
dtype: int32

In [139]:
df = pd.DataFrame({
    'id': [1,2,3,4],
    'name': ['Nithin', 'Godugu', 'Bhavith', 'Sri'],
    'age': [20,19,3,7]
})
df = df.set_index('id')
df

       name  age
id
1    Nithin   20
2    Godugu   19
3   Bhavith    3
4       Sri    7

In [140]:
type(df.loc[3])

pandas.core.series.Series

In [141]:
df1 = pd.DataFrame({
    'id': ['tt1','tt2','tt3'],
    'val' : [1,2,3]
})

df2 = pd.DataFrame({"id": ["tt3", "tt2", "tt1"], "val": [27, 18, 9]})
df2.set_index('id', inplace=True)
df1.set_index("id", inplace=True)

df1+df2

     val
id
tt1   10
tt2   20
tt3   30

In [142]:
df = pd.DataFrame(
    {
        "id": [1, 2, 3, 4],
        "name": ["Nithin", "Godugu", "Bhavith", "Sri"],
        "age": [20, 19, 3, 7],
    }
)
df = df.set_index("id")
df

       name  age
id
1    Nithin   20
2    Godugu   19
3   Bhavith    3
4       Sri    7

In [143]:
print(df.loc[1])
print(df.loc[1]['age'])
print(df.loc[1][0])

print(df.loc[1, 'name'])

df.set_index('name', inplace=True)

name    Nithin
age         20
Name: 1, dtype: object
20
Nithin
Nithin

C:\Users\nithi\AppData\Local\Temp\ipykernel_14040\4169343497.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df.loc[1][0])

In [144]:
print(df.loc["Nithin"])
print(df.loc["Nithin", "age"])

age    20
Name: Nithin, dtype: int64
20

In [145]:
print(df.iloc[0])
print(df.iloc[0, 0])

age    20
Name: Nithin, dtype: int64
20

In [146]:
df

         age
name
Nithin    20
Godugu    19
Bhavith    3
Sri        7

In [147]:
df.iat[1,-1]

19

In [148]:
df.at['Nithin', 'age'] = 21
df

         age
name
Nithin    21
Godugu    19
Bhavith    3
Sri        7

In [149]:
df.loc['Nithin'] = [22]
df

         age
name
Nithin    22
Godugu    19
Bhavith    3
Sri        7

In [150]:
df['job'] = ['Student', 'Student', 'Player', 'Student']
df

         age      job
name
Nithin    22  Student
Godugu    19  Student
Bhavith    3   Player
Sri        7  Student

In [ ]:
df = df[['name', 'age', 'job']]
df

In [ ]:
df["summary"] = df.apply(lambda row: f'{row["age"]} {row["name"]}', axis=1)
df

C:\Users\nithi\AppData\Local\Temp\ipykernel_14040\1325741597.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["summary"] = df.apply(lambda row: f'{row["age"]} {row["name"]}', axis=1)

      name  age      job    summary
0   Nithin   22  Student  22 Nithin
1   Godugu   19  Student  19 Godugu
2  Bhavith    3   Player  3 Bhavith
3      Sri    7  Student      7 Sri

In [ ]:
df['summary'][0]

C:\Users\nithi\AppData\Local\Temp\ipykernel_14040\430822468.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['summary'][0]

'age             22\njob        Student\nsummary        NaN\nName: Nithin, dtype: object'

In [ ]:
df

      name  age      job    summary
0   Nithin   22  Student  22 Nithin
1   Godugu   19  Student  19 Godugu
2  Bhavith    3   Player  3 Bhavith
3      Sri    7  Student      7 Sri

In [ ]:
df.drop('summary', axis=1)

KeyError: "['summary'] not found in axis"

In [ ]:
df

   index     name  age      job
0      0   Nithin   22  Student
1      1   Godugu   19  Student
2      2  Bhavith    3   Player
3      3      Sri    7  Student

In [152]:
df = df.reset_index()
df

      name  age      job
0   Nithin   22  Student
1   Godugu   19  Student
2  Bhavith    3   Player
3      Sri    7  Student

In [154]:
# df.iloc[0] = ["NithiN", 21, "Student", float('nan')]
df.iloc[1,2] = float('nan')
df

      name  age      job
0   Nithin   22  Student
1   Godugu   19      NaN
2  Bhavith    3   Player
3      Sri    7  Student

In [155]:
df.fillna({"summary":"TEST", "job":"Tester"})

      name  age      job
0   Nithin   22  Student
1   Godugu   19   Tester
2  Bhavith    3   Player
3      Sri    7  Student

In [156]:
df.iloc[3,1] = float('nan')
df

      name   age      job
0   Nithin  22.0  Student
1   Godugu  19.0      NaN
2  Bhavith   3.0   Player
3      Sri   NaN  Student

In [157]:
df['age'] = df.age.fillna(df.age.mean())
df

      name        age      job
0   Nithin  22.000000  Student
1   Godugu  19.000000      NaN
2  Bhavith   3.000000   Player
3      Sri  14.666667  Student

In [158]:
df.iloc[3, 1] = float("nan")
df

      name   age      job
0   Nithin  22.0  Student
1   Godugu  19.0      NaN
2  Bhavith   3.0   Player
3      Sri   NaN  Student

In [165]:
print(df[[True, True, True, True]])

df[[True, False, True, True]]

      name   age      job
0   Nithin  22.0  Student
1   Godugu  19.0      NaN
2  Bhavith   3.0   Player
3      Sri   NaN  Student

      name   age      job
0   Nithin  22.0  Student
2  Bhavith   3.0   Player
3      Sri   NaN  Student

In [ ]:
df.age.notna()

0     True
1     True
2     True
3    False
Name: age, dtype: bool

In [160]:
df[df.age.notna()]

      name   age      job
0   Nithin  22.0  Student
1   Godugu  19.0      NaN
2  Bhavith   3.0   Player

In [ ]:
for i, row in df.iterrows():
    # print(row[0])
    print(row["name"])

Nithin1
Godugu1
Bhavith1
Sri1

In [187]:
for i, col in df.items():
    print(col[0])

Nithin
22.0
Student

In [194]:
df[(df.age > 4) & (df.job.notna())]

     name   age      job
0  Nithin  22.0  Student

In [205]:
df
df[df.notna()]

      name   age      job
0   Nithin  22.0  Student
1   Godugu  19.0      NaN
2  Bhavith   3.0   Player
3      Sri   NaN  Student

In [208]:
df[df.name.str.startswith("N")]

     name   age      job
0  Nithin  22.0  Student

In [212]:
df.groupby('job').agg({
    'age':['min','max']
})

          age
          min   max
job
Player    3.0   3.0
Student  22.0  22.0

In [213]:
df1 = pd.DataFrame({
    'Item': ['A','B','C'],
    'Price': [10,20,30]
})

df2 = pd.DataFrame({"Item": ["D", "E", "F"], "Price": [40, 50, 60]})

In [215]:
df2

  Item  Price
0    D     40
1    E     50
2    F     60

In [222]:
pd.concat([df1,df2]).reset_index().drop('index',axis=1)

  Item  Price
0    A     10
1    B     20
2    C     30
3    D     40
4    E     50
5    F     60

In [223]:
df1 = pd.DataFrame({"Item": ["A", "B", "C"], "Price": [10, 20, 30]})

df2= pd.DataFrame({
    'Country': ['X','Y','Z'],
    'Avaial': [True,False, True]
})
df1

  Item  Price
0    A     10
1    B     20
2    C     30

In [224]:
df2

  Country  Avaial
0       X    True
1       Y   False
2       Z    True

In [226]:
pd.concat((df1,df2), axis=1)

  Item  Price Country  Avaial
0    A     10       X    True
1    B     20       Y   False
2    C     30       Z    True

In [227]:
df1 = pd.DataFrame({"Item": ["A", "B", "C"], "Price": [10, 20, 30]})
df2 = pd.DataFrame(
    {
        "Item": ["B", "C", "D"],
        "Country": ["X", "Y", "Z"],
    }
)
df2

  Item Country
0    B       X
1    C       Y
2    D       Z

In [229]:
df1

  Item  Price
0    A     10
1    B     20
2    C     30

In [239]:
pd.merge(df1, df2, how='outer')

  Item  Price Country
0    A   10.0     NaN
1    B   20.0       X
2    C   30.0       Y
3    D    NaN       Z